Tekla.Structures.TeklaStructuresInternal.MateriaClient.MateriaClientAdapter
Adapter class used for Materia-TS integration.

Tekla.Structures.TeklaStructuresInternal.MateriaClient.MateriaClientAdapter.ConnectionChanged


Tekla.Structures.TeklaStructuresInternal.MateriaClient.MateriaClientAdapter.Instance
Get the Tekla.Structures.TeklaStructuresInternal.MateriaClient.IMateriaClientAdapter instance

Tekla.Structures.TeklaStructuresInternal.MateriaClient.MateriaClientAdapter.Dispose


Tekla.Structures.TeklaStructuresInternal.MateriaClient.MateriaClientAdapter.Dispose(System.Boolean)
Dispose resources
disposing:

Tekla.Structures.TeklaStructuresInternal.MateriaClient.MateriaClientAdapter.Finalize
Finalizer

Tekla.Structures.TeklaStructuresInternal.MateriaClient.MateriaClientAdapter.IsConnectionActive


Tekla.Structures.TeklaStructuresInternal.MateriaClient.MateriaClientAdapter.Connect


Tekla.Structures.TeklaStructuresInternal.MateriaClient.MateriaClientAdapter.Disconnect


Tekla.Structures.TeklaStructuresInternal.MateriaClient.MateriaClientAdapter.LoadGraph(Tekla.Structures.TeklaStructuresInternal.MateriaClient.Asset)


Tekla.Structures.TeklaStructuresInternal.MateriaClient.MateriaClientAdapter.LoadGraph(Tekla.Structures.TeklaStructuresInternal.MateriaClient.Asset,System.Collections.Generic.List{Tekla.Structures.TeklaStructuresInternal.MateriaClient.GraphParameter})


Tekla.Structures.TeklaStructuresInternal.MateriaClient.MateriaClientAdapter.SearchAssets(System.String)
